{
  "results": [
    {
      "about": "This is output from feeding the raw .mvk video file into OpenAI Whisper api running locally in a Docker Container",
      "filename": "2024-05-24 13-07-14.mkv",
      "transcript": " Hello and welcome. My name is Brian and I'm going to be taking us through a short demonstration of the band management application I built recently. I built this application to help facilitate my cover band in booking shows, keeping track of venues, building set lists and keeping track of songs that we play and some other things. We'll go through those after we go ahead and sign up. I'm going to create two users. The first user is going to be the user that creates the band. The second user is going to be invited to the band by the first user. So let's go ahead and get started. We're going to create an account, put in an email here, demo9 at demo.com. I'm using a dummy email here because I don't currently have the email sending hooked up because I don't have this open to the public yet. I don't want to have this be overrun and spammed just yet until I put some more guards in place that prevent people creating millions of records. So we're going to go ahead and submit this. I'm going to go ahead and submit this. I'm going to go ahead and submit this. I'm going to go ahead and submit this. I'm going to go ahead and submit this. What's going to happen is on a separate screen. I'm going to grab the code from the machine logs. So this is deployed on fly.io. You put the code in here. Typically this will be emailed to you. So go ahead and submit that. Now we're ready. So I'm going to go ahead and put the username demo9 name demo9. I'm going to grab my secure password here. Then cut that out. So now we've created an account. So we have the demo9 user here. If we go over to the incognito window, we're going to create demo10. Go over to the machine logs again. Grab the code. And demo10 name demo10 password. I'm going to grab my password. So now we've got two users that are created and logged in. We're going to go over to the first user and we're going to take a look at the sort of your blank state here. So what you see now is just your profile. You can add a picture to your profile. So let's go ahead and do that for both the users. So we'll just grab a dummy image here. Save that photo over here. Profile. Grab a dummy image. Save photo. Okay, so now both the users have a profile photo. So now if we go to the first user demo9. Go back to home and we're going to create a band. So the band name is going to be demo9 band. We're going to create that band. So now this takes us to your bands route. And I have all the data model and the capabilities that you can have multiple bands. However, I've hidden the create band button here for simplicity in the MVP. So for the MVP, a user can just have one band. So if we click into this, we can see that this demo9, the members here is just listed as the demo9 user and they're considered the admin of this band. So if we go here, we can just sort of specify the instrument that they play so we can just say lead vocals. So now that's persisted under the band user entity, which is associated with this particular band. So if we want to add a member, this is achieved by pasting in the user ID of the member you want to invite the ID here is not to have this be some sort of discoverability platform where you can just find the name. You can just find random people and invite them to your band. The idea is that you know everyone in real life in your band. And that way, you know, that will facilitate the exchange of this user ID. So we're going to go ahead and switch to the other user here and we're going to go to the user profile and we can just copy the user ID. You can see a little toast here. If we go back and we dropped that in here and we send the invitation, we can now see here that we have invited demo 10. So if we come back over to demo 10 and we go to their invitations, we can see that the demo9 band has invited you. We're going to put your entering here as lead guitar and accept. So now that opens up the sub menu and displays the band so they can see this as well. And now we can see that demo 10 is a member and their instrument is lead guitar. So the next logical step would be to figure out, you know, what songs you play. So if we go to the songs route, we can see that we don't have any songs yet. There's two ways to add songs. You can add a song individually and just input the information or you can do a bulk upload. So let's go ahead and do that for a time sake. So if we grab a bulk upload, we can choose the CSV. We can grab the bulk song upload CSV. And we get a little preview here. These are the songs that my band plays. I just been using these and if we go ahead and click upload, all those records get created. You'll notice here that in the songs route that we have the sole icon here and you have the option to upload a YouTube URL. But if you don't upload a YouTube URL, this is just a pre configured search that takes the song name and the artist and does a search based on that. So you can see that on the bottom left hand corner there. It's a link to Google search for 1985 by Boeing for soup YouTube video. So if we click that opens up a new tab and that can quickly take you to the video if you need to get a refresher. So that's just a handy little hack. So if we look at an individual song, we can upload lyrics. So right now the upload lyrics supports a PDF upload and a word document upload. If we go ahead and grab the lyrics from 1985, upload those. We get that we see those displayed here. I have these modes because what I'm doing is I'm fetching and persisting the document as a blob. In an SQL or SQL light database. And when I fetch it, I'm parsing it to text and displaying that text here. So the text has new lines and the difference between these modes is essentially just removing more or less new lines. And depending on how your, you know, your file was set up when you uploaded it, you know, you know, you're removing or adding new lines might make it format in a way that's, you know, that you like better. So just defaults to mode two. This will come into play a little later with the lyrics. So the next thing we're going to need is venues. Right. So if we go ahead and add a new venue, we can just say for example, House of blues Cleveland location. Cleveland capacity. It'll just say a thousand contact names. So now here you can optionally add a contact name or you can add one later. We'll just do. John Doe. Through at bar.com and phone number. 123. And submit. So now we see we have an entry in our venues list. So we can see right now that in this table, there are no events listed. And we click on this and we can see now we have name, location, capacity and contacts. And we can add another contact if you want. So to say. To bar. To bar.com. And that gets added pretty quickly and you can just remove them to click right there. So now that we have songs. We have a venue. It's time to create an event. So we go ahead and add an event. And we have some metadata here like for example, if your band is required to bring its own sound system. You know, so this will indicate that. I plan to add other metadata in the future that might be helpful, but this is just sort of the MVP. So we can select the venue. We can see that so we only have one venue. There's only one option for the venues here. We have a start and time. So we can say, you know, 8 p.m. 12 a.m. Event name. Super fun event. We can go ahead and set a date here. I'll just set it June 11th. Payment. We'll just say. Around three or three bucks notes. Gonna be a. On time. And technician. So we can also associate a technician. We can create one yet, but we can associate that one after we create a technician. So let's submit the event. So now we have the event super fun event. If we go to the availability calendar, we can now see that super fun event. Is in the calendar and it's indicated with this green green box here. So let's go to text and create a text. We don't we don't have any technicians yet. What a technician is is like a sound technician that you might need to run the PA system for your band or a. Lighting technician or maybe you're hiring some people to help you move gear or equipment around. So let's go ahead and create a tech. So let's go ahead and create a sound technician. And this will be a Sammy sound phone. Email to at bar.com. Rate will just say he cost 125 a night. Contact info. This is just a placeholder for notes. So you can just say, you know, best to text after 5 p.m. And if we go ahead and submit this tech. So now we can see here we have a list. We can go to the detail view. We get his contact information. We can see his rates. If we back up here, we can sort of open up these notes. If we go back to the event and we go ahead and here's like a little shortcut for editing. So we can see here and other now that we've created a technician. We can add a technician. If we update the event and go to the event detail page. Now we can see that the event tech is listed here. The address is here and the venue. So this address is another little quality of life hack thing. So this basically just opens up a link to a Google Maps search with the name of the venue and the location. And 9 times out of 10, you know, you're going to get a hit if you put in the full legitimate name of the venue you're going to play at. So this could just be like a quick handy thing. In the future, I could extend this with, you know, actually putting in either coordinates or some, you know, integrate the Google Maps API. But that's for down the road. So now we have an event. We have songs. We have venue to play at. The last thing to show off is a set list. So we can go ahead and create a set list. You can associate a set list with an event. So let's go ahead and associate this set list to the super fun event. Set list name. So my cool set list. And a set list can be associated with multiple events like if you want to reuse it, which is very common in a band to sort of cycle through different sets. So you can drag and drop songs into each set. You can add a set to the list. So if you have like a, you know, two set set list for the night or a three set or however many want. I have a little shortcut here for seeding set. So if we want to seed a three set set list, that helps. You can search for a song here. So we have a couple here. So we'll just say last last night we can add. You know, then we can drag that around and go here and just try Ruby. So. Yeah. So then once you're done, you can submit that. And you create a set list. You can see that it has one event associated with it. Up here, you can sort of, you know, teleport to that event. And now the event detail page. Has the, you know, the set list here. So you can go to that. And one thing to note that, you know, this, this would be a sort of thing that would be handy for a band member. When they're on stage, if for example, we forgot to print out the set list. So you need to get a quick refresher on the lyrics, like say, oh, I can't remember the first lyric to the song. Because that's, that's often the hardest part when you're trying to sing a song from memory. It's just getting that first couple of words and then, you know, muscle memory tends to take over from there. So you'll notice here that there's two different icons. So here we have a little piece of paper icon. This indicates that we actually do have uploaded song lyrics. And this other one are again, sort of off the cuff, Google searches. So this will search for the, you know, the guitar chords. And often within this ultimate guitar will be like the first hit on the search. And you can see, you know, the lyrics here, if you're in a pinch, right? So that would be a quick way to get you to the lyrics if you didn't, you know, have them uploaded ahead of time. So now if we go to the event, we can see that the event list, our table entry has a date, a pay rate, and you can view the set list. If we go back to our bands detail view, we can see that now we're just sort of accumulating the, the year end revenue based on, you know, the payments that have been put in. And so the last handy thing is when we're booking shows. So you can see like, you know, when we're booking shows for next year, any band member. So if I go over to the current lead guitar member, demo 10 user, and we go to that users blackout days, we can see here sort of like a blank slate. But just by clicking around, a user can insert some blackout days like say, for example, you know, they're going on family vacation this week. You can see a little toast pop up here. So we'll go ahead and add a bunch of blackout days here. So that means that if say, for example, you know, the demo nine user was the band leader and is in charge of, you know, communicating with venues about availability. If we go to the availability page, the band leader can see it a quick glance that, you know, that that we're not available on any of these days. So if you go, if he goes ahead and clicks on this, you can see that the demo 10 user is unavailable that day. And you know, that that gives him the opportunity to maybe reach out to them, like say if it was in the distant future and say, hey, is this, is this blackout date still accurate or could you potentially make a show this day. So it just facilitates the exchange of information that way. Another thing about the availability calendar is that, you know, you could potentially just send this to a venue and say, hey, check out our open dates and, you know, pick a day or happy to play. Because you can in advance sort of, you know, blackout any days that you want to have off as a band or if you only want to play so many shows a month and you have to this month already, you can just blackout the other weekend days. We've done that sometimes in my band. So, so yeah, so then you can click on this and you can sort of either see, you know, go to the event detail or, you know, go directly to the set list. So that can be handy. There's lots of ways since all these data models are sort of links within the application that you can, you know, navigate as a shortcut to things you need. Another little thing I'll add about set list is like you can clone a set list, like say, for example, this little icon here, this takes you to like sort of it creates a copy of my cool set list. Um, my cool alternate set list and, you know, you could do whatever you want here. So let's just for fun. Just seed a completely new three song set list and throwing a couple different songs at the top. And so right now all the events have set list associated with them and obviously it wouldn't make sense to have more than one set list within event. So we don't have any that this can be assigned to you. But when we do create a new event, we can add it at that time. So, so yeah, that's basically the front to back of the band management application and the features it has currently. Thanks for sticking around this long if you did. And yeah, if anyone wants, you know, credentials to the staging environment, I'm happy to give them so they can play around this and maybe think about using it for their band. Eventually, I will, you know, properly deploy this to the public and see if it can be useful to other people right now. My band just uses it on the production deployment. Yeah, so again, my name is Brian and thanks again for sticking around and seeing my demo."
    }
  ]
}
